In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sample.csv')

In [3]:
df

   id    name  gender  age    salary
0   1    Mike    male   25  1000.200
1   2  Eleven  famale   23   566.243
2   3    Mark    male   34  3000.660
3   4    Bill    male   49  4436.300
4   5    Otis    male   38  5534.100
5   6   Maeve  female   37  2354.800

In [4]:
df.head()

   id    name  gender  age    salary
0   1    Mike    male   25  1000.200
1   2  Eleven  famale   23   566.243
2   3    Mark    male   34  3000.660
3   4    Bill    male   49  4436.300
4   5    Otis    male   38  5534.100

In [5]:
df.tail()

   id    name  gender  age    salary
1   2  Eleven  famale   23   566.243
2   3    Mark    male   34  3000.660
3   4    Bill    male   49  4436.300
4   5    Otis    male   38  5534.100
5   6   Maeve  female   37  2354.800

In [6]:
df.head(3)

   id    name  gender  age    salary
0   1    Mike    male   25  1000.200
1   2  Eleven  famale   23   566.243
2   3    Mark    male   34  3000.660

In [7]:
df.tail(2)

   id   name  gender  age  salary
4   5   Otis    male   38  5534.1
5   6  Maeve  female   37  2354.8

In [11]:
df.shape

(6, 5)

In [25]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [26]:
df.columns

Index(['id', 'name', 'gender', 'age', 'salary'], dtype='object')

In [20]:
# 查看ow数据
df[3:5]

   id  name gender  age  salary
3   4  Bill   male   49  4436.3
4   5  Otis   male   38  5534.1

In [38]:
# 查询指定column数据
# 方法一
df.name

0      Mike
1    Eleven
2      Mark
3      Bill
4      Otis
5     Maeve
Name: name, dtype: object

In [30]:
# 方法二
df['name']

0      Mike
1    Eleven
2      Mark
3      Bill
4      Otis
5     Maeve
Name: name, dtype: object

In [42]:
df[['name']]

     name
0    Mike
1  Eleven
2    Mark
3    Bill
4    Otis
5   Maeve

In [46]:
df[['name', 'age']]

     name  age
0    Mike   25
1  Eleven   23
2    Mark   34
3    Bill   49
4    Otis   38
5   Maeve   37

In [49]:
# 查询指定位置
df[1:2].name

1    Eleven
Name: name, dtype: object

In [52]:
df[1:2]['name']

1    Eleven
Name: name, dtype: object

In [55]:
df[1:2][['name']]

     name
1  Eleven

In [57]:
df.name[1]

'Eleven'

In [59]:
df['name'][1]

'Eleven'

In [62]:
df[['name']][1:2]

     name
1  Eleven

In [69]:
# 来看看上边部分数据的类型吧
type(df[1:2])

pandas.core.frame.DataFrame

In [65]:
type(df.name)

pandas.core.series.Series

In [64]:
type(df['name'])

pandas.core.series.Series

In [70]:
type(df[['name']])

pandas.core.frame.DataFrame

In [72]:
# 查看df一些简单的统计信息
df.describe()

             id        age       salary
count  6.000000   6.000000     6.000000
mean   3.500000  34.333333  2815.383833
std    1.870829   9.500877  1929.703520
min    1.000000  23.000000   566.243000
25%    2.250000  27.250000  1338.850000
50%    3.500000  35.500000  2677.730000
75%    4.750000  37.750000  4077.390000
max    6.000000  49.000000  5534.100000

In [73]:
df.max()

id             6
name        Otis
gender      male
age           49
salary    5534.1
dtype: object

In [77]:
df.mean()

id           3.500000
age         34.333333
salary    2815.383833
dtype: float64

In [78]:
df.min()

id              1
name         Bill
gender     famale
age            23
salary    566.243
dtype: object

In [79]:
# SQL style
df[['name','age']][df['salary']>df['salary'].mean()]

   name  age
2  Mark   34
3  Bill   49
4  Otis   38

In [90]:
# df2 = df.set_index('id', inplace = Flase)
# df2
df2 = df.set_index('id', inplace=False)

In [91]:
df2

      name  gender  age    salary
id
1     Mike    male   25  1000.200
2   Eleven  famale   23   566.243
3     Mark    male   34  3000.660
4     Bill    male   49  4436.300
5     Otis    male   38  5534.100
6    Maeve  female   37  2354.800

In [92]:
df

   id    name  gender  age    salary
0   1    Mike    male   25  1000.200
1   2  Eleven  famale   23   566.243
2   3    Mark    male   34  3000.660
3   4    Bill    male   49  4436.300
4   5    Otis    male   38  5534.100
5   6   Maeve  female   37  2354.800